s = "ciao à¹€à¸”à¸µà¹‹à¸¢à¸ cane §à¸­à¸µà¸?à¸‹à¸±à¸?à¸„à¸£à¸¹à¹ˆà¸„à¸‡à¹€à¸£à¸µà¸¢à¸?à¸—à¸µà¸¡ Graphic à¹€à¸‚à¹‰à¸²à¸¡à¸²à¹?à¸¥à¹‰à¸§à¸›à¸£à¸±à¸šà¹€à¸¥à¹‡à¸?à¸™à¹‰à¸­à¸¢à¹ƒà¸«à¹‰à¸¡à¸±à¸™à¸„à¸¥à¹‰à¸²à¸¢à¸?à¸±à¸™à¸¢à¸´à¹ˆà¸‡à¸‚à¸¶à¹‰à¸™à¸„à¸£à¸±à¸š à¹€à¸žà¸£à¸²à¸°à¸«à¸²à¸?à¹€à¸­à¸²à¸¡à¸²à¹€à¸—à¸µà¸¢à¸šà¸?à¸±à¸™à¸„à¸‡à¸¡à¸µà¸›à¸±à¸?à¸«à¸²à¸­à¸¢à¹ˆà¸²à¸‡à¸§à¹ˆà¸²à¸„à¸£à¸±à¸š."
import string
printable = set(string.printable)
st = "".join(filter(lambda x: x in printable, s))
print(s)
print(st)
print("x15" in printable)